In [5]:
import pandas as pd
import numpy as np
person={
    'Age':[20,30,50],
    'Salary':[1000,2000,3000]
}
df=pd.DataFrame(person)
df

   Age  Salary
0   20    1000
1   30    2000
2   50    3000

In [7]:
df['Age']=df['Age']/df['Age'].max()
df

   Age  Salary
0  0.4    1000
1  0.6    2000
2  1.0    3000

In [8]:
df['Salary']=df['Salary']/df['Salary'].max()
df

   Age    Salary
0  0.4  0.333333
1  0.6  0.666667
2  1.0  1.000000

In [9]:
df

   Age    Salary
0  0.4  0.333333
1  0.6  0.666667
2  1.0  1.000000

In [ ]:
e